src/CF/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПродукта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКод1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКод2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКод3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКод4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКод5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПриобретения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыполненияРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкиИРегистрацияОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступленияТовара</v8:Type>
						<v8:Type>cfg:DocumentRef.Комплектация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/AccumulationRegisters/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>Товары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СписаниеИлиОприходование</Name>
					<Comment>Списание или оприходование (не приобретение, продажа, возврат или перемещение)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CF/Catalogs/СерииНоменклатуры/Forms/ФормаВыбора/Ext/Form/Module.bsl
// sza150703-1527 с ост
// sza150511-0254 
// sza140420-0444  
// sza131127-2130  
&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000300", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ОтборПоСкладу 			  = Параметры.ОтборПоСкладу;
		Номенклатура			  = Параметры.Номенклатура;
		ОтборПоНоменклатура 	  = ЗначениеЗаполнено(Номенклатура);
		ВызовИзРасходаТовара 	  = Параметры.ВызовИзРасходаТовара;
		ИспользуетсяОтборПоСкладу = ВызовИзРасходаТовара И ЗначениеЗаполнено(Параметры.ОтборПоСкладу) И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам");
		ДатаОстатка = Параметры.ОтборПоДате;
		Если ДатаОстатка = '00010101000000' Тогда
			ДатаОстатка = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
		КонецЕсли;
		
		Список.ТекстЗапроса = "ВЫБРАТЬ СправочникСерииНоменклатуры.Ссылка,
		|	СправочникСерииНоменклатуры.ПометкаУдаления,
		|	СправочникСерииНоменклатуры.Предопределенный,
		|	СправочникСерииНоменклатуры.Владелец,
		|	СправочникСерииНоменклатуры.Код,
		|	СправочникСерииНоменклатуры.Наименование,
		|	СправочникСерииНоменклатуры.КодПродукта,
		|	СправочникСерииНоменклатуры.Комментарий,
		|	СправочникСерииНоменклатуры.ДополнительныйКод1,
		|	СправочникСерииНоменклатуры.ДополнительныйКод2,
		|	СправочникСерииНоменклатуры.ДополнительныйКод3,
		|	СправочникСерииНоменклатуры.ДополнительныйКод4,
		|	СправочникСерииНоменклатуры.ДополнительныйКод5
		|ИЗ Справочник.СерииНоменклатуры КАК СправочникСерииНоменклатуры ";
		
		Если ВызовИзРасходаТовара Тогда								  
			Список.ТекстЗапроса = Список.ТекстЗапроса + " ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Товары.Остатки(
			|				&ДатаОстатка,
			|				(НЕ &ОтборПоСкладу
			|					ИЛИ Склад = &Склад)
			|					И (НЕ &ОтборПоНоменклатура ИЛИ Номенклатура = &Номенклатура)) КАК ТоварыОстатки
			|		ПО (ТоварыОстатки.СерияНоменклатуры = СправочникСерииНоменклатуры.Ссылка)
			|ГДЕ ТоварыОстатки.КоличествоОстаток > 0";			
			
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПоСкладу", ИспользуетсяОтборПоСкладу);
			Список.Параметры.УстановитьЗначениеПараметра("Склад", ОтборПоСкладу);
			Список.Параметры.УстановитьЗначениеПараметра("ДатаОстатка", ДатаОстатка);	
			Список.Параметры.УстановитьЗначениеПараметра("ОтборПоНоменклатура", ОтборПоНоменклатура);
			Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Номенклатура);	
		КонецЕсли;
		
		Элементы.ОтборДляДокумента.Видимость = ВызовИзРасходаТовара;
		Элементы.Номенклатура.Видимость		 = ВызовИзРасходаТовара;
		Элементы.Отбор.Видимость 			 = НЕ ВызовИзРасходаТовара;
		
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
		
		ИспользоватьДополнительныеКодыСерий = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьДополнительныеКодыСерий");
		Элементы.ДополнительныйКод1.Видимость = ИспользоватьДополнительныеКодыСерий;
		Элементы.ДополнительныйКод2.Видимость = ИспользоватьДополнительныеКодыСерий;
		Элементы.ДополнительныйКод3.Видимость = ИспользоватьДополнительныеКодыСерий;
		Элементы.ДополнительныйКод4.Видимость = ИспользоватьДополнительныеКодыСерий;
		Элементы.ДополнительныйКод5.Видимость = ИспользоватьДополнительныеКодыСерий;	
	КонецЕсли;
	
КонецПроцедуры
